* Hex/Pointer tests
#+begin_src C :include <stdio.h> :include <stdlib.h>
char *string;
string = (void *)0;

int i = printf("%s", string);
int j = printf("this %s", string);
int k = printf("%s this", string);

printf("(%i)(%i)(%i)", i, j, k);
#+end_src

#+RESULTS:
: (null)this (null)(null) this(6)(11)(11)
